Revit 2027 API
ParameterTypeId.FabricationPartAlias Property
 "Alias"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationPartAlias { get; }
Public Shared ReadOnly Property FabricationPartAlias As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationPartAlias {
	ForgeTypeId^ get ();
}
static member FabricationPartAlias : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace